geosmall/Arduino_Core_STM32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Flight Controller boards

Flight_ctrl.name=Flight Controllers

Flight_ctrl.build.core=arduino
Flight_ctrl.build.board=Flight_ctrl
Flight_ctrl.build.variant_h=variant_{build.board}.h
Flight_ctrl.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Flight_ctrl.upload.maximum_size=0
Flight_ctrl.upload.maximum_data_size=0

# FC_REVO_F405RG board
Flight_ctrl.menu.pnum.FC_REVO_F405RG=Revo F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.node="NODE_F405RG,REVO"
Flight_ctrl.menu.pnum.FC_REVO_F405RG.upload.maximum_size=1048576
Flight_ctrl.menu.pnum.FC_REVO_F405RG.upload.maximum_data_size=131072
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.mcu=cortex-m4
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.fpu=-mfpu=fpv4-sp-d16
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.float-abi=-mfloat-abi=hard
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.board=FC_REVO_F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.series=STM32F4xx
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.product_line=STM32F405xx
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.variant=STM32F4xx/FC_Revo_F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Flight_ctrl.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Flight_ctrl.menu.upload_method.swdMethod.upload.protocol=0
Flight_ctrl.menu.upload_method.swdMethod.upload.options=-g
Flight_ctrl.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Flight_ctrl.menu.upload_method.serialMethod.upload.protocol=1
Flight_ctrl.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Flight_ctrl.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Flight_ctrl.menu.upload_method.dfuMethod.upload.protocol=2
Flight_ctrl.menu.upload_method.dfuMethod.upload.options=-g
Flight_ctrl.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.clipboard=Clipboard (Copy Path)
Flight_ctrl.menu.upload_method.clipboard.upload.protocol=0
Flight_ctrl.menu.upload_method.clipboard.upload.options=-g
Flight_ctrl.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Dev boards

Dev_boards.name=Development Boards

Dev_boards.build.core=arduino
Dev_boards.build.board=Dev_boards
Dev_boards.build.variant_h=variant_{build.board}.h
Dev_boards.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Dev_boards.upload.maximum_size=0
Dev_boards.upload.maximum_data_size=0

# BlackPill F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC=BlackPill F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.node="NODE_F401CC,BlkPill"
Dev_boards.menu.pnum.BLACKPILL_F401CC.upload.maximum_size=262144
Dev_boards.menu.pnum.BLACKPILL_F401CC.upload.maximum_data_size=65536
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.mcu=cortex-m4
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.fpu=-mfpu=fpv4-sp-d16
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.board=BLACKPILL_F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.series=STM32F4xx
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.product_line=STM32F401xC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.variant=STM32F4xx/Dev_Blackpill_F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.variant_h=variant_BLACKPILL_F401Cx.h
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.cmsis_lib_gcc=arm_cortexM4lf_math

# DAISY_SEED
Dev_boards.menu.pnum.DAISY_SEED=Daisy Seed H750IB 
Dev_boards.menu.pnum.DAISY_SEED.node="NODE_H750IB,DaisySeed"
Dev_boards.menu.pnum.DAISY_SEED.upload.maximum_size=131072
Dev_boards.menu.pnum.DAISY_SEED.upload.maximum_data_size=524288
Dev_boards.menu.pnum.DAISY_SEED.build.mcu=cortex-m7
Dev_boards.menu.pnum.DAISY_SEED.build.fpu=-mfpu=fpv5-d16
Dev_boards.menu.pnum.DAISY_SEED.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.DAISY_SEED.build.board=DAISY_SEED
Dev_boards.menu.pnum.DAISY_SEED.build.series=STM32H7xx
Dev_boards.menu.pnum.DAISY_SEED.build.product_line=STM32H750xx
Dev_boards.menu.pnum.DAISY_SEED.build.variant=STM32H7xx/Daisy_Seed
Dev_boards.menu.pnum.DAISY_SEED.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
Dev_boards.menu.pnum.DAISY_SEED.build.ldscript=STM32H750IB_flash.lds
Dev_boards.menu.pnum.DAISY_SEED.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} -DSTM32H750IB -DARM_MATH_CM7 -Dflash_layout -DHSE_VALUE=16000000 -DUSE_HAL_DRIVER -DUSE_FULL_LL_DRIVER -DDATA_IN_D2_SRAM -DNDEBUG=1 -DRELEASE=1

# DevEBoxH750VB
Dev_boards.menu.pnum.DevEBoxH750VB=DevEBox H750VB
Dev_boards.menu.pnum.DevEBoxH750VB.node="NODE_H750VB,DevEBox"
Dev_boards.menu.pnum.DevEBoxH750VB.upload.maximum_size=131072
Dev_boards.menu.pnum.DevEBoxH750VB.upload.maximum_data_size=524288
Dev_boards.menu.pnum.DevEBoxH750VB.build.mcu=cortex-m7
Dev_boards.menu.pnum.DevEBoxH750VB.build.fpu=-mfpu=fpv5-d16
Dev_boards.menu.pnum.DevEBoxH750VB.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.DevEBoxH750VB.build.board=DevEBoxH750VB
Dev_boards.menu.pnum.DevEBoxH750VB.build.series=STM32H7xx
Dev_boards.menu.pnum.DevEBoxH750VB.build.product_line=STM32H750xx
Dev_boards.menu.pnum.DevEBoxH750VB.build.variant=STM32H7xx/Dev_DevEBoxH750VB
Dev_boards.menu.pnum.DevEBoxH750VB.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
Dev_boards.menu.pnum.DevEBoxH750VB.build.ldscript=STM32H750VB_flash.lds
Dev_boards.menu.pnum.DevEBoxH750VB.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} -DSTM32H750VB -DARM_MATH_CM7 -Dflash_layout -DHSE_VALUE=25000000 -DUSE_HAL_DRIVER -DUSE_FULL_LL_DRIVER -DDATA_IN_D2_SRAM -DNDEBUG=1 -DRELEASE=1

# DevEBoxH743VI
Dev_boards.menu.pnum.DevEBoxH743VI=DevEBox H743VI
Dev_boards.menu.pnum.DevEBoxH743VI.node="NODE_H743VI,DevEBox"
Dev_boards.menu.pnum.DevEBoxH743VI.upload.maximum_size=2097152
Dev_boards.menu.pnum.DevEBoxH743VI.upload.maximum_data_size=524288
Dev_boards.menu.pnum.DevEBoxH743VI.build.mcu=cortex-m7
Dev_boards.menu.pnum.DevEBoxH743VI.build.fpu=-mfpu=fpv5-d16
Dev_boards.menu.pnum.DevEBoxH743VI.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.DevEBoxH743VI.build.board=DevEBoxH743VI
Dev_boards.menu.pnum.DevEBoxH743VI.build.series=STM32H7xx
Dev_boards.menu.pnum.DevEBoxH743VI.build.product_line=STM32H743xx
Dev_boards.menu.pnum.DevEBoxH743VI.build.variant=STM32H7xx/Dev_DevEBoxH743VI
Dev_boards.menu.pnum.DevEBoxH743VI.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
Dev_boards.menu.pnum.DevEBoxH743VI.build.ldscript=STM32H743VI_flash.lds
Dev_boards.menu.pnum.DevEBoxH743VI.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} -DSTM32H743VI -DARM_MATH_CM7 -Dflash_layout -DHSE_VALUE=25000000 -DUSE_HAL_DRIVER -DUSE_FULL_LL_DRIVER -DDATA_IN_D2_SRAM -DNDEBUG=1 -DRELEASE=1

# DevMatekH743VI
Dev_boards.menu.pnum.DevMatekH743VI=Matek H743VI
Dev_boards.menu.pnum.DevMatekH743VI.node="NODE_H743VI,Matek"
Dev_boards.menu.pnum.DevMatekH743VI.upload.maximum_size=2097152
Dev_boards.menu.pnum.DevMatekH743VI.upload.maximum_data_size=524288
Dev_boards.menu.pnum.DevMatekH743VI.build.mcu=cortex-m7
Dev_boards.menu.pnum.DevMatekH743VI.build.fpu=-mfpu=fpv5-d16
Dev_boards.menu.pnum.DevMatekH743VI.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.DevMatekH743VI.build.board=DevMatekH743VI
Dev_boards.menu.pnum.DevMatekH743VI.build.series=STM32H7xx
Dev_boards.menu.pnum.DevMatekH743VI.build.product_line=STM32H743xx
Dev_boards.menu.pnum.DevMatekH743VI.build.variant=STM32H7xx/Dev_MatekH743VI
Dev_boards.menu.pnum.DevMatekH743VI.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
Dev_boards.menu.pnum.DevMatekH743VI.build.ldscript=STM32H743VI_flash.lds
Dev_boards.menu.pnum.DevMatekH743VI.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} -DSTM32H743VI -DARM_MATH_CM7 -Dflash_layout -DHSE_VALUE=8000000 -DUSE_HAL_DRIVER -DUSE_FULL_LL_DRIVER -DDATA_IN_D2_SRAM -DNDEBUG=1 -DRELEASE=1

# Upload menu
Dev_boards.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Dev_boards.menu.upload_method.swdMethod.upload.protocol=0
Dev_boards.menu.upload_method.swdMethod.upload.options=-g
Dev_boards.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

