geosmall/Arduino_Core_STM32/boards.txt
Dev_boards.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Dev_boards.menu.dbg.enable_all.build.flags.debug=-g
Dev_boards.menu.dbg.none=None
Dev_boards.menu.dbg.enable_sym=Symbols Enabled (-g)
Dev_boards.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Dev_boards.menu.dbg.enable_log=Core logs Enabled
Dev_boards.menu.dbg.enable_log.build.flags.debug=

Nucleo_64.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_all.build.flags.debug=-g
Nucleo_64.menu.dbg.none=None
Nucleo_64.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_64.menu.dbg.enable_log=Core logs Enabled
Nucleo_64.menu.dbg.enable_log.build.flags.debug=

Disco.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Disco.menu.dbg.enable_all.build.flags.debug=-g
Disco.menu.dbg.none=None
Disco.menu.dbg.enable_sym=Symbols Enabled (-g)
Disco.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Disco.menu.dbg.enable_log=Core logs Enabled
Disco.menu.dbg.enable_log.build.flags.debug=

# C Runtime Library
Flight_ctrl.menu.rtlib.nano=Newlib Nano (default)
Flight_ctrl.menu.rtlib.nanofp=Newlib Nano + Float Printf
Flight_ctrl.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Flight_ctrl.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Flight_ctrl.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Flight_ctrl.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Flight_ctrl.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Flight_ctrl.menu.rtlib.full=Newlib Standard
Flight_ctrl.menu.rtlib.full.build.flags.ldspecs=

Dev_boards.menu.rtlib.nano=Newlib Nano (default)
Dev_boards.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs --specs=nosys.specs
Dev_boards.menu.rtlib.nanofp=Newlib Nano + Float Printf
Dev_boards.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Dev_boards.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Dev_boards.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Dev_boards.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Dev_boards.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Dev_boards.menu.rtlib.full=Newlib Standard
Dev_boards.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

Disco.menu.rtlib.nano=Newlib Nano (default)
Disco.menu.rtlib.nanofp=Newlib Nano + Float Printf
Disco.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Disco.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Disco.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Disco.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Disco.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Disco.menu.rtlib.full=Newlib Standard
Disco.menu.rtlib.full.build.flags.ldspecs=
